# Pandas Notes

In [9]:
# open source library build on top of NumPy
# allows for  fast analysis, data cleaning and preparation
# excels in performance and productivity
# has built in visualizations
# can work with data from a wide variety of sources

# equivalent to dataframes in R

In [10]:
import numpy as np
import pandas as pd

### Series

In [11]:
# similar to NumPy array
# but series can be indexed by labels
labels = ['a','b','c']
mydata = [10,20,30]
arr = np.array(mydata)
d = {'a':10, 'b':20, 'c':30}

In [12]:
pd.Series(data = mydata, index = labels)

a    10
b    20
c    30
dtype: int64

In [13]:
# Series works on NumPy array as well as lists
pd.Series(arr, index = labels)

a    10
b    20
c    30
dtype: int32

In [14]:
# Series also takes in a dictionary, keys act as index
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
# Can stors any value
pd.Series([1,'a',2.4])

0      1
1      a
2    2.4
dtype: object

### Looking up information

In [16]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [17]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [18]:
ser1['USA']

1

In [19]:
# Operations are performed by key
# If a key is not found in one of the Series, you get NaN
# Integres are conberted into Floar
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

### Dataframes
#### Expands on Series and this is what we will be using extensively

In [20]:
from numpy.random import randn
np.random.seed(101)

** Dataframes are a bunch of series (columns) that share an index (row index)
**

In [21]:

df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
# Selecting Columns
# call by columns name
# returns a series
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
# can return multiple columns
# in this case, we get back a dataframe
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [24]:
df['new'] = df['W'] + df ['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [25]:
# for drop method, by default axis = 0 which refers to index (rows)
# if I want to refer to columns, I need to make axis = 1
# by default it does not affect df
# after dropping column, df still includes this column
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df.drop('new', axis=1, inplace = True)
# For some reason, I had to execute the code in this cell first 
# before I could display df in the following cell

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
# to drop rows
df.drop('E') # since axis by default = 0, it will work on rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [29]:
# returns a tuple with number of rows and columns
# hence rows are referred to as 0 axis and columns as 1 axis
df.shape

(5, 4)

In [30]:
# Selecting rows
# Even rows are series similar to column
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [31]:
# Or we can use index based location
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [32]:
# Can also use both row index and column index to get value
df.loc['B','Y']

-0.8480769834036315

In [33]:
df.loc[['A','C'],['W','Y']]

          W         Y
A  2.706850  0.907969
C -2.018168  0.528813

**Conditional Selection**

In [34]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [35]:
# Similar to how is applied to NumPy arrays
# We get values where this is true
# NaN where it is false
# you only get NaN values if you are doing conditoonal statements
# on the entire dataframe
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

** We will be using the column based conditional operator as shown below extensively in the course **

In [36]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [37]:
# This does not return any NaN values
# Rows where the value for the conditional operator output
# is False are just dropped

resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

** You can also combine multiple steps (stack commands) **

In [38]:
# Writing these one line abstraction takes up less memory 
# than writing the code by breaking into multiple lines 
# with extra variables
df[df['W'] > 0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [39]:
# 'and' operator can only operate on a single bool value
# use '&' instead of 'and' function to operate on multiple bool values
# '|' is the replacement for 'or' function
df[(df['W']>0) & (df['Y']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

### Index

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
# Following will reset index to numerical and 
# old index will become a new column
# Note that this does not do it inplace.
# Use inplace = TRUE to make it change df
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [42]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [43]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [44]:
# Adding column as index
# Overwrites index
# This is not inplace as with reset_index
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### Multi index and index hierarchy

In [45]:
#Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list (zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [46]:
# Zip function: Makes pairwise tuples
list (zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [47]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [48]:
df = pd.DataFrame(randn(6,2), hier_index,['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [49]:
# Call from outside index and continue calling to inside index
df.loc['G1'].loc[2]

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [50]:
# You can name indices
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [51]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [52]:
# returns a cross-section of data
# returns all values from a particular level
# you need to specify the level name and 
# the value of that level that you want to pull
df.xs(1, level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

### Missing Data
#### drop.na or fill.na

In [53]:
d = {'A':[1,2,np.nan],'B':[5, np.nan, np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [54]:
# Drops any rows (defualt) with 1 or more missing values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [55]:
# For dropping columns with NA Values
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [56]:
# We can also specify threshold for 
# how many NA values have to be present
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [57]:
# Filling NA with a values
df.fillna("Fill")

      A     B  C
0     1     5  1
1     2  Fill  2
2  Fill  Fill  3

In [58]:
#Filling NA with means of columns
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby

In [59]:
# Similar to what is there in SQL
# allows you to group rows based off a column 
# and perform aggregrate functions on them.

In [60]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [61]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [62]:
# creates a groupby object
byComp = df.groupby('Company')

In [63]:
# mean will ignore non numeric values
# Output is a DataFrame
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [64]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [65]:
# You can call all this in one line
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [66]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

** Very helpful for summarizing data **

In [67]:
# very helpful to get summary of data
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

### Merging, Joining, and Concatenating

** Concatenate **

In [68]:
# refer to notebook on Pandas -- merging, joining and concatenating
# as most of the work is typing the data frames

In [69]:
# use pd.concat([df1,df2,df3]) 
# This will concatenate along rows by default
# i.e. it adds rows of df2 as new rows after rows of df1
# Lining of data is done by column index

# use pd.concat([df1,df2,df3], axis=1) 
# This will concatenate along columns
# Lining of data is done by row index
# If index does not match up, then any
# missing values will be made NaN

** Merge **

Joins by column

In [76]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [77]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [72]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [73]:
# inner is similar to SQL merge
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

** Join **

In [74]:
# Joining is similar to merge but instead of using columns 
# as keys for merging, we use the index of the DataFrame to merge

In [75]:
left.join(right.drop('key',axis=1))
# removing key from one of the data frames to avoid errors

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

### Operations

In [79]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

** Finding Unique Values **

In [81]:
df['col2'].unique() # Unique Values

array([444, 555, 666], dtype=int64)

In [82]:
df['col2'].nunique() # Number of unique values

3

In [83]:
df['col2'].value_counts() # How many times each value occured

444    2
555    1
666    1
Name: col2, dtype: int64

** Selecting Data **

In [88]:
df[(df['col1']>2) & (df['col2']== 444)]

   col1  col2 col3
3     4   444  xyz

** Apply Method **

In [89]:
def times2(x):
    return x*2

In [90]:
df['col1'].apply(times2) # similar to map function

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [91]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [93]:
# Apply is especially powerful when used with Lambda functions
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [94]:
df.drop('col1', axis = 1) # axis = 1 for column; inplace=True also

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [96]:
df.columns # returns the names of the columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [102]:
df.index # Gives infromation about row index

RangeIndex(start=0, stop=4, step=1)

In [104]:
df.sort_values('col2') # Note that the index stays attached

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [105]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

** Pivot Table **

In [106]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [107]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [108]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Data Input & Output
* CSV
* Excel
* HTML
* SQL

In [109]:
# Refer to Videos to see what needs to be installed
# conda install sqlalchemy
# conda install lxml
# conda install html5lib
# conda install BeautifulSoup4

** CSV **

In [115]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [119]:
df.to_csv('My_output', index = False) # done want to save index

In [120]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

** Excel **

In [121]:
# Pandas can only import the data
# It can not import formualae or macros

In [129]:
df = pd.read_excel('Excel_Sample.xlsx', sheet_name = 'Sheet1')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [130]:
df.to_excel('Excel_Sample2.xlsx', sheet_name = 'NewSheet')

** HTML **

In [133]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [136]:
type(df) # each item in the list is a table in the HTML

list

In [138]:
df[0].head(5)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","July 26, 2017"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

** SQL **

In [139]:
# Little more involved
# Refer to notebooks provided

In [140]:
# Pandas is probably not the bext source to work with SQL
# You should look for specialized libraries for this.